import java.util.Scanner;

public class  MagicNumbers {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int magicNum = Integer.parseInt(scanner.nextLine());

        for (int i = 1; i <= 9; i++) {
            for (int j = 1; j <= 9; j++) {
                for (int k = 1; k <= 9; k++) {
                    for (int l = 1; l <= 9; l++) {
                        for (int m = 1; m <= 9; m++) {
                            for (int o = 1; o <= 9; o++) {
                                int result = i * j * k * l * m * o;
                                if (result == magicNum)
                                    System.out.print("" + i + j + k + l + m + o + " ");

                            }

                        }

                    }

                }

            }

        }
    }
}
/*
* 9. Магически числа
Тествайте решението си тук.
Да се напише програма, която чете едно цяло "магическо" число, въведено от потребителя, и изкарва всички
възможни 6-цифрени числа, за които произведението на неговите цифри е равно на "магическото" число.
Пример: "Магическо число" -> 2
 111112 -> 1 * 1 * 1 * 1 * 1 * 2 = 2
 111121 -> 1 * 1 * 1 * 1 * 2 * 1 = 2
 111211 -> 1 * 1 * 1 * 2 * 1 * 1 = 2
 112111 -> 1 * 1 * 2 * 1 * 1 * 1 = 2
 121111 -> 1 * 2 * 1 * 1 * 1 * 1 = 2
 211111 -> 2 * 1 * 1 * 1 * 1 * 1 = 2
Вход
Входът се чете от конзолата и се състои от едно цяло число в интервала [1…600000].
Изход
На конзолата трябва да се отпечатат всички "магически" числа, разделени с интервал.*/