import java.util.Scanner;

public class Numbers1ToNwithStep3 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int n = Integer.parseInt(scanner.nextLine());

        for (int i = 1; i <=n ; i+=3) {


            System.out.println(i);

        }
    }
}
/*
* 2. Числата от 1 до N през 3
Напишете програма, която чете число n, въведено от потребителя, и отпечатва числата от 1 до n през 3 (със
стъпка 3).
Примерен вход и изход
вход    изход        вход     изход     вход    изход
10        1           7        1         15       1
          4                    4                  4
          7                    7                  7
         10                                       10
                                                  13



1. Прочетете входните данни от конзолата – едно цяло число n

2. Направете for цикъл от 1 до n (включително) и задайте стъпка 3. Това означава, че при всяка
итерация на цикъла, променливата i ще увеличава стойността си с 3, вместо с 1:

3. В тялото на цикъла принтирайте променливата i:*/